In [19]:
import pandas as pd
import numpy as np
import datetime

df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 6,
        "B": ["A", "B", "C"] * 8,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 4,
        "D": np.random.randn(24),
        "E": np.random.randn(24),
        "F": [datetime.datetime(2013, i, 1) for i in range(1, 13)]
        + [datetime.datetime(2013, i, 15) for i in range(1, 13)],
    }
)
df

        A  B    C         D         E          F
0     one  A  foo  0.671506  1.352929 2013-01-01
1     one  B  foo  0.576262 -0.561001 2013-02-01
2     two  C  foo  0.704441  0.198609 2013-03-01
3   three  A  bar -0.832828  1.180678 2013-04-01
4     one  B  bar -1.827273  1.175554 2013-05-01
5     one  C  bar  1.366266  0.902061 2013-06-01
6     two  A  foo -0.808282 -0.094952 2013-07-01
7   three  B  foo -2.357921  0.249416 2013-08-01
8     one  C  foo  0.337656  0.523720 2013-09-01
9     one  A  bar -0.071988  1.143066 2013-10-01
10    two  B  bar  0.149748 -0.624428 2013-11-01
11  three  C  bar  0.908852 -1.007406 2013-12-01
12    one  A  foo -0.214454 -1.000322 2013-01-15
13    one  B  foo  0.003695  0.099002 2013-02-15
14    two  C  foo -0.370173 -0.981560 2013-03-15
15  three  A  bar -1.581919  1.109864 2013-04-15
16    one  B  bar  1.467840 -0.246827 2013-05-15
17    one  C  bar -0.160594 -0.390090 2013-06-15
18    two  A  foo -0.091216 -0.321039 2013-07-15
19  three  B  foo  0.112520 -1.167228 2013-08-15
20    one  C  foo  0.689811  0.616332 2013-09-15
21    one  A  bar  0.437133  1.523968 2013-10-15
22    two  B  bar  0.008259  2.972145 2013-11-15
23  three  C  bar -0.418793  0.006969 2013-12-15

In [20]:
f = pd.pivot_table(df,index=['A','B'], columns="C", values="D")
f

C             bar       foo
A     B
one   A  0.182572  0.228526
      B -0.179717  0.289978
      C  0.602836  0.513733
three A -1.207373       NaN
      B       NaN -1.122701
      C  0.245030       NaN
two   A       NaN -0.449749
      B  0.079003       NaN
      C       NaN  0.167134

In [21]:
pf = pd.pivot_table(df,index=['A','B'], columns="C", values="D",aggfunc=['sum', 'mean', 'count']).copy()
pf

              sum                mean           count
C             bar       foo       bar       foo   bar  foo
A     B
one   A  0.365145  0.457052  0.182572  0.228526   2.0  2.0
      B -0.359433  0.579957 -0.179717  0.289978   2.0  2.0
      C  1.205673  1.027467  0.602836  0.513733   2.0  2.0
three A -2.414747       NaN -1.207373       NaN   2.0  NaN
      B       NaN -2.245401       NaN -1.122701   NaN  2.0
      C  0.490060       NaN  0.245030       NaN   2.0  NaN
two   A       NaN -0.899498       NaN -0.449749   NaN  2.0
      B  0.158006       NaN  0.079003       NaN   2.0  NaN
      C       NaN  0.334268       NaN  0.167134   NaN  2.0